common/tools/htmls.php

SELECT * FROM `options` WHERE `type`='website'
---
    public static function site()
    {
        $info = OptionsModel::find()->where(['type'=>'website'])->asArray()->one();

SELECT * FROM `banner` WHERE `type`='hdp'
---
    public static function getPiece($type)
    {
        $info = BannerModel::find()->where(['type' => $type])->asArray()->all();

SELECT * FROM `article` WHERE `id`='12'
UPDATE `article` SET `hits`=9 WHERE `id`=12
---
    public static  function ar()
    {
        $id = $_GET['id'];
        $model =ArticleModel::findOne($id);
        $hits = $model['hits'];
        $model-> hits = $hits + 1;
        $model->save();
        $info =  ArticleModel::find()->where(['id'=>$id])->one();

SELECT * FROM `term`
---
    public static  function getBread($id)
    {
        $arr = TermModel::find()->asArray()->all();

SELECT * FROM `page` WHERE `pid`='12'
---
        public static function page($pid)
        {
          $info = PageModel::find()->asArray()->where(['pid'=>$pid])->one();